{
  "result": [
    {
      "patentNumber": "TW202439348A",
      "abstract": "A method of manufacturing laminated solid aluminum capacitors, laminated ceramic capacitors with innovative structures and aluminum electrode applied resistors with high reliability for automotive use. It combines the advantages of the grain boundary capacitor structure and tantalum capacitors to create a single-layer capacitor with an extremely small pico Farad, and then uses the method of increasing the area and stacking to generate a multilayer ceramic capacitor (MLCC) to obtain a capacitor with a capacitance of 1 mini Farad or even a higher capacitance, so as to replace the barium titanate (BaTiO3) dielectric materials and the unstable liquid electrolytic capacitors with highly stable, high DC bias, and fast charge and discharge multilayer grain boundary capacitors, the stability of electronic components can be improved to a higher level."
    },
    {
      "patentNumber": "KR20240176646A",
      "abstract": "본 기술은 이미지 시그널 프로세서에 관한 것으로, 본 기술에 따른 이미지 시그널 프로세서는, 진폭을 변조하는 광원을 이용하는 거리 측정 센서로부터 이미지에 포함된 픽셀들 각각에 대응하는 깊이 값들을 포함하는 이미지 데이터를 수신하는 데이터 수신부, 상기 광원의 진폭에 기초하여 픽셀들을 이용하는 제1 검출 방법 또는 미리 설정된 커널들을 이용하는 제2 검출 방법 중 타겟 이미지에 포함된 모션을 검출하는 타겟 모션 검출 방법을 결정하고, 상기 타겟 모션 검출 방법에 따라 상기 타겟 이미지에 모션 포함 여부를 나타내는 검출 결과를 생성하는 모션 검출부 및 상기 검출 결과에 기초하여 상기 타겟 이미지보다 먼저 생성된 이전 이미지들에 대응하는 이미지 데이터를 이용하는 제1 노이즈 제거 방법 또는 상기 타겟 이미지에 대응하는 이미지 데이터만을 이용하는 제2 노이즈 제거 방법 중 상기 타겟 이미지에 포함된 노이즈를 제거하는 타겟 노이즈 제거 방법을 결정하고, 상기 타겟 노이즈 제거 방법에 따라 노이즈 제거 동작을 수행하는 노이즈 제거부를 포함할 수 있다."
    },
    {
      "patentNumber": "TW202441948A",
      "abstract": "An image signal processor includes a down-scaling circuit that generates a first image signal by down-scaling an input image signal, an image processing engine including a first recomposition circuit that generates a target image signal based on the first image signal, a first up-scaling circuit that generates a third image signal based on a second image signal generated by the image processing engine, a second recomposition circuit that generates an output image signal based on the third image signal, a second up-scaling circuit that generates a fourth image signal by up-scaling the first image signal, and a correction information generation circuit that generates an image information signal by extracting, from the input image signal and the fourth image signal, information about an image quality loss of the first image signal, and transmits the image information signal to the first or the second recomposition circuit depending on a mode."
    },
    {
      "patentNumber": "TW202441408A",
      "abstract": "A method for mapping a spiking neural network design onto a configurable neuromorphic processor, the method comprising: defining a resource model describing the neuromorphic processor, defining a network definition file describing the spiking neural network design, wherein the further method comprises: dividing the neurons of the network definition file into one or more partitions, each partition comprising a portion of the neurons from one of the layers; selecting one of the partitions; selecting an available one of the planes of the resource model, wherein a number of neurons of the plane is equal to or greater than a number of neurons in the selected partition; and mapping the neurons of the selected partition to the neurons of the selected plane of the resource model, wherein a neuron of the selected partition is mapped to a neuron of the selected plane if the neuron of the selected plane has available interconnections matching the interconnections to the neuron of the selected partition."
    },
    {
      "patentNumber": "TW202441401A",
      "abstract": "A processor implementing techniques for processor extensions to protect stacks during ring transitions is provided. In one embodiment, the processor includes a plurality of registers and a processor core, operatively coupled to the plurality of registers. The plurality of registers is used to store data used in privilege level transitions. Each register of the plurality of registers is associated with a privilege level. An indicator to change a first privilege level of a currently active application to a second privilege level is received. In view of the second privilege level, a shadow stack pointer (SSP) stored in a register of the plurality of registers is selected. The register is associated with the second privilege level. By using the SSP, a shadow stack for use by the processor at the second privilege level is identified."
    },
    {
      "patentNumber": "TW202441403A",
      "abstract": "Disclosed is an integrated circuit including intellectual property (IP) pieces including test logics, respectively, a scanner configured to collect debugging data from the test logics of the IP pieces, and an encryption circuit configured to convert the debugging data into an encrypted data form."
    },
    {
      "patentNumber": "KR20240176198A",
      "abstract": "본 발명은 칼라의 수축 및 팽창에 대응하는 디스크형 완충부재를 구비하는 플러그밸브에 관한 것으로, 내측 중앙에 제1설치공간이 구비되고, 전단에 유체 유입구가, 후단에 유체 배출구가 구비되며, 상단 및 하단에 상하로 개방된 한 쌍의 잠금볼트 설치구가 각각 구비되는 밸브 몸체; 상기 밸브 몸체 내 제1설치공간에 고정 설치되며, 내측 중앙에 원통형 구조의 설치 및 회전을 위한 소정에 제2설치공간이 구비되고, 전단 및 후단에 전후로 개방되는 한 쌍의 제1부시 설치구가 구비되며, 좌측단 및 우측단에 좌우로 개방되는 한 쌍의 제2부시 설치구가 구비되는 제1칼라(Collar); 상기 제1칼라 내 제2설치공간에 회전 가능하도록 삽입 설치되고, 전후 방향을 따라 개방된 유체 이동로가 관통 형성되어 회전 위치에 따라 상기 유체 이동로 양단의 상기 유체 유입구 및 유체 유출구와의 연통 여부가 조절되게 하는 스템(Stem); 한 쌍의 상기 잠금볼트 설치구에 각각 삽입 설치되어 상기 밸브 몸체의 상부 및 하부에 결합되는 한 쌍의 잠금볼트; 및 소정의 탄성력을 구비한 소재로 마련된 디스크(Disc) 형태의 부재로서, 상기 제1칼라의 상단 및 하단과 한 쌍의 상기 잠금볼트 각각의 사이에 적어도 하나 이상씩 적층 배치되는 적어도 한 쌍 이상의 디스크형 완충부재;를 포함한다."
    },
    {
      "patentNumber": "KR20240176141A",
      "abstract": "본 발명은 차량용 에어 공급 장치 및 상기 차량용 에어 공급 장치에 적용되는 에어 공급 밸브에 관한 것이다. 개시되는 차량용 에어 공급 장치가 에어 공급 밸브, 에어 공급 부재 및 에어 분배 부재를 포함함에 따라 조립 구조가 간단해지면서 조립되는 부분에서의 리크 발생 현상이 방지될 수 있고, 상기 에어 공급 밸브가 밸브 본체 부재, 흡기 플런저 부재, 벤트 플런저 부재, 흡기측 코어 부재, 벤트측 코어 부재, 흡기측 코일 부재 및 벤트측 코일 부재를 포함함에 따라 상기 흡기 플런저 부재 및 상기 벤트 플런저 부재의 작동 시 발생되는 충격 소음이 최소화될 수 있을 뿐만 아니라, 외부로 상기 에어가 벤트될 때 발생되는 노이즈의 저감도 이루어질 수 있게 되는 장점이 있다."
    },
    {
      "patentNumber": "KR102745120B1",
      "abstract": "본 발명은, 가스가 충진된 가스 용기와 체결하여 가스 배출 여부를 체크할 수 있는 가스 체크 밸브 구조체가 제공된다."
    },
    {
      "patentNumber": "TW202441097A",
      "abstract": "Proportional vacuum valve apparatus has a vacuum supply port, a vacuum outlet port in communication with the vacuum supply port, a valve seat, and a valve element movable into and out of engagement with the valve seat to close and open the valve permitting vacuum flow between the vacuum outlet port and the vacuum supply port. A control arrangement is operable to open and close the valve. The control arrangement provides a proportional positive pressure supply to pilot operation of the valve element. The apparatus is particularly suited to being used in silicon wafer fabrication processes."
    },
    {
      "patentNumber": "TW202441094A",
      "abstract": "Provided is a gate valve that reduces generation of particles and deterioration of a seal member disposed on a valve body by having the seal member contact an opening surface of a processing unit from a perpendicular direction without swinging the valve body with respect to an opening of the processing unit. This gate valve comprises a moving body that operates together with a valve body, and a conversion mechanism that moves the moving body in each of a perpendicular direction to an opening surface, and a cross direction crossing the perpendicular direction. The conversion mechanism comprises: a first operation mechanism that moves in the cross direction, and moves the moving body in the cross direction; and a second operation mechanism that moves the moving body in the perpendicular direction. The operation by the second operation mechanism includes an operation by an additional movement of the first movement mechanism in the cross direction from a state in which the moving body is restricted from moving in the cross direction."
    },
    {
      "patentNumber": "KR20240176334A",
      "abstract": "본 개시의 기술적 사상에 의한 일 양태에 따른 차량의 도난 방지 시스템은, 모터와 연결된 액추에이터 보드, 및 상기 액추에이터 보드와 케이블을 통해 연결된 제어기를 포함하고, 상기 액추에이터 보드는, 상기 모터를 구동하기 위한 전력을 수신하는 제1 전력 공급 단자 및 제2 전력 공급 단자; 상기 제1 전력 공급 단자와 상기 제2 전력 공급 단자 중 적어도 하나와 상기 모터 사이에 연결되는 스위치부; 및 상기 제어기로부터 인가되는 신호에 응답하여 상기 스위치부의 상태를 온(ON) 상태 또는 오프(OFF) 상태로 제어하는 디지털회로부를 포함할 수 있다."
    },
    {
      "patentNumber": "KR20240176584A",
      "abstract": "본 발명은 영구자석을 포함하는 리니어 액추에이터 및 이를 포함하는 전자해머장치에 관한 것으로, 보다 상세하게는, EI 코어 구조 기반의 영구자석을 포함하는 리니어 액추에이터 및 이를 포함하는 전자해머장치에 관한 것이다. 본 발명은, E코어(110)와, 상기 E코어(110)에 대향하여 배치되는 I코어(120)와, 상기 E코어(110)에 권선되는 코일부(130)를 포함하는 리니어 액추에이터(100)로서, 상기 E코어(110) 및 상기 I코어(120) 중 적어도 하나에 설치되는 영구자석부(140)와, 상기 E코어(110)에 연결되는 스프링부(150)를 포함하는 것을 특징으로 하는 리니어 액추에이터(100)를 개시한다."
    },
    {
      "patentNumber": "KR20240176099A",
      "abstract": "스마트 액츄에이터를 활용한 그리퍼가 개시되며, 상기 스마트 액츄에이터를 활용한 그리퍼는, 베이스 플레이트; 각각이 상기 베이스 플레이트로부터 하측으로 연장되고, 상기 베이스 플레이트의 둘레 방향을 따라 간격을 두고 배치되는 복수의 빔; 및 상기 둘레 방향으로 연장되며 상기 복수의 빔의 하부를 연결하는 연장 부재를 포함하되, 상기 연장 부재는, 미리 설정된 온도를 기준으로 구분되는 제1 온도 상태 및 제2 온도 상태 중 상기 제1 온도 상태에서 미리 기억된 형상으로 수축 변형되도록 하는 형상 복원력이 발생되고, 상기 제2 온도 상태에서 상기 형상 복원력이 미발생되는 SMA 부재를 포함하고, 상기 복수의 빔은, 상기 제1 온도 상태에서 상기 형상 복원력의 작용에 의해 내측으로 탄성 휨 변형되고, 상기 제2 온도 상태에서 상기 형상 복원력의 미작용에 따라 외측으로 탄성 복원되도록 하는 플렉서블 부재 형태로 제공된다."
    },
    {
      "patentNumber": "KR20240176107A",
      "abstract": "액추에이터는 전도성 물질로 형성되는 베이스, 베이스로부터 연장하고 전도성 물질로 형성되는 연장부, 연장부로부터 연결되고 전도성 물질로 형성되는 헤드부, 및 형상 기억 고분자 물질로 형성되고 연장부로부터 열을 제공받는 수축부를 포함하고, 수축부가 열을 제공받아 수축함에 따라, 연장부가 수축한다."
    },
    {
      "patentNumber": "KR20240176263A",
      "abstract": "본 발명은 관성형 전자기식 리니어 액추에이터에 관한 것으로, 보다 상세하게는, 코일이 권선된 권선부와 영구자석을 포함하는 영구자석부 사이의 선형구동을 위한 관성형 전자기식 리니어 액추에이터에 관한 것이다. 본 발명은, 코일이 권선되는 고정자(100)와; 영구자석(M)이 설치되는 가동자(200)와; 상기 고정자(100)에 고정결합되는 축부재(300)를 포함하는 관성형 전자기식 리니어 액추에이터로서, 상기 고정자(100)는, 중공의 원통형상으로 형성되며 상기 축부재(300)의 길이방향에 평행한 축방향(A)을 따라 간격을 두고 배치되는 제1 및 제2 보빈(112, 114)과, 코일이 상기 제1 및 제2 보빈(112, 114)의 외주면 둘레에 각각 권선된 제1 및 제2 권선부(122, 124)를 포함하며, 상기 가동자(200)는, 상기 제1 및 제2 보빈(112, 114)의 외측 둘레를 감싸는 한 쌍의 제1 코어부분(212a, 212b) 및 상기 한 쌍의 제1 코어부분(212a, 212b)과 연결되며 상기 제1 및 제2 보빈(112, 114) 사이에 배치되는 제2 코어부분(214)을 포함하는 코어(210)와, 상기 코어(210)에 설치되어 상기 제1 및 제2 권선부(122, 124)와 각각 상호작용하는 제1 및 제2 영구자석부(222, 224)를 포함하는 것을 특징으로 하는 관성형 전자기식 리니어 액추에이터를 개시한다."
    },
    {
      "patentNumber": "TW202441537A",
      "abstract": "A process of manufacturing inductor includes preparing coil, using a composite material to prepare a T-core and a U-core, disposing the coil in the cavity of the U-core with the extensions disposed externally of the cavity, inserting the projection through the coil with the cavity being covered by the platform, bending the extensions, heating the assembled U-core, the coil, and the T-core to form a half-finished product, baking the half-finished product, painting and peeling the baked half-finished product, and surface treating the peeled half-finished product by coating a composite layer on exposed surfaces of the extensions to obtain an inductor."
    },
    {
      "patentNumber": "KR20240179079A",
      "abstract": "본 발명의 일 실시예에 따른 인덕터 모듈은 내부공간을 형성하는 하우징, 상기 하우징 내부에 배치되는 인덕터, 및 상기 내부공간을 덮는 기판을 포함하고, 상기 기판은, 상기 인덕터와 전기적으로 연결되는 도전패턴을 포함한다."
    },
    {
      "patentNumber": "KR20240175709A",
      "abstract": "본 발명의 일 실시예에 따른 인덕터 모듈은 제1 인덕터를 수용하는 제1 내부공간을 형성하는 제1 수용부, 제2 인덕터를 수용하는 제2 내부공간을 형성하는 제2 수용부, 및 상기 제1 수용부 및 상기 제2 수용부의 외면으로부터 연장되는 방열핀을 포함하고, 상기 제1 수용부와 상기 제2 수용부는 서로 이격되어 형성된다."
    },
    {
      "patentNumber": "TWM661457U",
      "abstract": "A multilayer inductor comprises a plurality of magnetic layers and metal electrode tracks formed on the magnetic layers. A ceramic-inorganic material composite is placed in the magnetic core area in the pattern of coils formed by the metal electrode tracks. The ceramic-inorganic material composite comprises two or more first layers and second layers. The first layers comprise a ceramic material having a positive slope of the dielectric constant versus temperature curve. The second layers comprise an inorganic material having a negative slope of the dielectric constant versus temperature curve. The first layers and the second layers are stacked on each other in an alternating manner. The metal electrode tracks are arranged in such a way that the void space between two adjacent metal electrode tracks where no effective magnetic lines of force exist is minimized. The multilayer inductor enables stable device characteristics and enhances the inductive performance."
    },
    {
      "patentNumber": "TWM661230U",
      "abstract": "No abstract available"
    },
    {
      "patentNumber": "TW202441947A",
      "abstract": "A system and method of receiving HDLC communications is disclosed. The system measures the pulse width of the incoming signal and converts each pulse into a series of bits, based on its pulse width. In this way, the reception of the HDLC communication is not dependent on any particular clock rate and is adaptable. The system takes advantages of the fact that the flag is a string of six consecutive bits that are all \"1\". Thus, the longest positive pulse width may be used to determine the bit rate. This allows the system to operate over a very broad range of data rates."
    },
    {
      "patentNumber": "TW202439132A",
      "abstract": "A microcontroller authority management execution method includes providing a microcontroller, generating an authority management interface, configuring a user mode and an administrator mode corresponding to memory resources of the microcontroller by using a development software kit through the authority management interface, and indicating available peripheral device sets and function sets for the user mode through the memory resources when the administrator mode is performed. When the peripheral device sets and the function sets are used under the user mode, the peripheral device sets and the function sets are unchangeable."
    },
    {
      "patentNumber": "KR20240176072A",
      "abstract": "본원에서 설명되는 시스템들 및 방법들은 복수의 클록 신호들을 생성하기 위해 MCU 내의 소스 클록 신호를 팬아웃한다. 시스템들 및 방법들은 MCU 내의 복수의 입력/출력(I/O) 그룹들로 복수의 클록 신호들을 분배하고, 여기서, 복수의 I/O 그룹들 각각은 MCU의 복수의 전력 도메인들 중 상이한 전력 도메인에 대응한다. 시스템들 및 방법은 복수의 I/O 그룹들에 커플링된 복수의 주변기기들에 복수의 클록 신호들을 제공한다."
    },
    {
      "patentNumber": "KR20240176579A",
      "abstract": "본 발명은 (메타)아크릴레이트기를 포함하는 폴리아믹산 에스테르 중합체, 및 폴리이미드 중합체를 포함하는 바인더; 다관능성 (메타)아크릴레이트계 화합물; 및 블랙 착색제;를 포함하는 블랙 감광성 조성물에 관한 것이다."
    },
    {
      "patentNumber": "KR20240176837A",
      "abstract": "본 발명은 레이저 다이오드 제조방법에 관한 것으로, 개시된 구성은 기판 상에 다중 우물층과, 스페이서층과, 식각 저지층과, 클래드층 및, 저항 접촉층을 순차적으로 적층하는 단계와; 상기 저항 접촉층 상에 식각 마스크를 형성하는 단계와; 건식 식각공정을 실시하여 상기 저항 접촉층 및 상기 클래드층 일부를 수직 식각하는 단계; 및 습식 식각공정을 실시하여 상기 수직 식각된 클래드층을 역메사 구조의 클래드층 패턴을 형성하는 단계를 포함한다."
    },
    {
      "patentNumber": "TW202441807A",
      "abstract": "The present invention provides a light emitting diode structure, which is arranged on a die-bonding element. The light emitting diode structure includes a substrate, a semiconductor light emitting structure and an electrode. The substrate includes a first surface and a second surface opposite to the first surface, and the substrate is in contact with the die-bonding element through the first surface. The semiconductor light emitting structure is located on the second surface of the substrate, and the semiconductor light emitting structure includes a light emitting surface. The electrode is located on the light emitting surface. Wherein the first surface of the substrate forms an uneven surface to increase the contact area with the die-bonding element."
    },
    {
      "patentNumber": "TW202442100A",
      "abstract": "An organic light emitting diode device includes: a substrate including a plurality of sub-pixels; a thin film transistor (TFT) in each of the plurality of sub-pixels, wherein the TFT has at least one inorganic layer; an encapsulation layer on an organic light emitting layer, wherein the encapsulation layer includes at least one organic encapsulation layer and at least one inorganic encapsulation layer; and an opening exposing the inorganic layer of the TFT, wherein the opening connects the at least one inorganic encapsulation layer with the inorganic layer of the TFT."
    },
    {
      "patentNumber": "TW202441865A",
      "abstract": "A pulsed laser diode driver includes a laser diode package having a first anode terminal, a cathode terminal, a laser diode, a first bond wire, and a second bond wire. A cathode of the laser diode is electrically connected to the cathode terminal, an anode of the laser diode is electrically connected to a first end of the first bond wire and to a first end of the second bond wire. A second end of the first bond wire is electrically connected to the first anode terminal, and a second end of the second bond wire is electrically connected to a capacitor. One or more switches are configured to control a current flow through the first and second bond wires to produce a high-current pulse through the laser diode, the high-current pulse corresponding to a peak current of a resonant waveform developed at the anode of the laser diode."
    },
    {
      "patentNumber": "KR20240175254A",
      "abstract": "본 발명의 일 실시예는 신축성과 자가치유 특성을 가지는 반도체층 및 이를 포함하는 트랜지스터를 제공한다. 본 발명의 일 실시 예에 따른 신축성과 자가치유 특성을 가지는 트랜지스터는 전극, 절연막, 반도체층의 모든 부품이 자가치유 고분자로 제작되어 트랜지스터 자체를 칼로 절단한 후 그 부위를 다시 접촉시켰을 때, 절단 전의 성능과 거의 유사한 성능을 나타내며 50% 이상 신축한 경우에도 소자의 On/Off 특성이 유지가 가능한 효과가 있다."
    },
    {
      "patentNumber": "TW202442098A",
      "abstract": "A thin film transistor including an active layer including a channel, a first connection portion and a second connection portion contacting opposite sides of the channel; and a gate electrode overlapping the channel of the active layer. Further, the active layer includes a first active layer; a second active layer on the first active layer in the first connection portion and the second connection portion of the active layer; and a third active layer contacting the first active layer in the channel and contacting the second active layer in the first connection portion and the second connection portion."
    },
    {
      "patentNumber": "TW202441607A",
      "abstract": "Embodiments described herein may be related to apparatuses, processes, systems, and/or techniques for forming backside contacts on a transistor structure by forming, during front-side processing, trenches through the transistor structure into a silicon wafer, and then, using a catalytic oxidant material that is subsequently removed, forming an oxide structure in the silicon wafer around the trenches to isolate the backside gate contact from the source/drain trenches. Other embodiments may be described and/or claimed."
    },
    {
      "patentNumber": "TW202441770A",
      "abstract": "Disclosed are complementary field effect transistors (CFETs) with balanced n and p drive current, and methods for making the same. In an aspect, a CFET structure comprises an nFET with horizontal p-doped nanosheet channels arranged in a first vertical stack, each horizontal p-doped nanosheet channel having a width W1, and connecting a first source contact to a first drain contact through a first gate-all-around (GAA) region having a length L1. The CFET structure further comprises a pFET with horizontal n-doped nanosheet channels arranged in a second vertical stack disposed on the first vertical stack, each horizontal n-doped nanosheet channel having a width W2, and connecting a second source contact to a second drain contact through a second GAA region having a length L2, wherein W2/L2 is not equal to W1/L1."
    },
    {
      "patentNumber": "TW202439942A",
      "abstract": "A storage transistor of a charge-trapping non-volatile memory includes a semiconductor substrate, a well region, a gate structure, a spacer, a first doped region and a second doped region. The well region is formed in a surface of the semiconductor substrate. The first doped region and the second doped region are formed in the well region. The gate structure includes a first tunneling layer, a second tunneling layer, a third tunneling layer, a trapping layer, a blocking layer and a gate layer. The first tunneling layer is contacted with the surface of the well region. The second tunneling layer covers the first tunneling layer. The third tunneling layer covers the second tunneling layer. The trapping layer covers the third tunneling layer. The blocking layer covers the trapping layer. The gate layer covers the blocking layer."
    },
    {
      "patentNumber": "KR20240176604A",
      "abstract": "본 명세서의 일 실시예에 따른 표시 장치는, 본 명세서의 일 실시예에 따른 표시 장치는, 표시 영역 및 표시 영역을 둘러싸는 비표시 영역을 포함하는 기판, 기판 상에서 표시 영역에 배치되는 복수의 트랜지스터, 복수의 트랜지스터와 연결되고, 애노드, 발광층 및 캐소드를 포함하는 발광 소자, 발광 소자 상에 배치되고, 제1 무기 봉지층, 제1 무기 봉지층 상에 배치되는 유기 봉지층, 유기 봉지층 상에 배치되는 제2 무기 봉지층을 포함하는 봉지층 및 기판 상에서 비표시 영역에 배치되는 복수의 구조물을 포함하고, 제1 무기 봉지층 및 제2 무기 봉지층 각각은 복수의 구조물 중 기판 최외곽에 배치된 제1 구조물을 기준으로 이격되어 배치된다."
    },
    {
      "patentNumber": "KR20240176414A",
      "abstract": "교통 시스템이 개시된다. 본 시스템은 표출부에 표시되는 단속 기준 정보 및 식별 정보를 포함하는 촬영 영상을 획득하는 표출 정보 획득부, 소정 조건에 따라 가변하는 단속 기준 정보가 설정되고, 설정된 단속 기준 정보에 따라 도로를 통행하는 객체 영상 및 통행 정보를 획득하는 통행 정보 획득부 및 촬영 영상, 객체 영상 및 통행 정보를 매칭한 단속 검증 정보를 생성하는 단속 검증 정보 제공부를 포함한다."
    },
    {
      "patentNumber": "KR20240176228A",
      "abstract": "외부 장비의 케이블 연결 시에 인터페이스를 통해 유입되는 EOS(Electrical Over Stress)를 감지 및 접지하여 EOS 불량을 방지할 수 있는 디스플레이 장치 및 그의 EOS 불량 방지 방법에 관한 것으로, 복수의 케이블들 중 비활성화 모드의 케이블이 존재하면 비활성화 모드의 케이블에 상응하는 적어도 하나의 연결핀이 접지되도록 EOS 접지부를 제어하고, 비활성화 모드의 케이블이 활성화 모드로 변경되면 적어도 하나의 연결핀이 접지 해제되도록 EOS 접지부를 제어할 수 있다."
    },
    {
      "patentNumber": "KR20240176552A",
      "abstract": "편광자; 및 상기 편광자의 일면에 적층되며 포지티브 C 층 및 네가티브 B층을 포함하는 위상차층을 포함하고, 상기 포지티브 C 층은 상기 편광자 및 상기 네가티브 B 층 사이에 위치하고, 상기 편광자의 광 흡수축을 0°라고 할 때 상기 네가티브 B 층의 지상축은 -1° 내지 1°이고, 상기 네가티브 B 층은 파장 550nm에서 면내 위상차가 70 내지 150nm이고 이축성 정도는 1.0 내지 1.8이며 상기 포지티브 C층과 상기 네가티브 B층의 적층체는 파장 550nm에서 두께 방향 위상차가 -52 내지 30nm인 편광판 및 이를 포함하는 광학표시장치가 제공된다."
    },
    {
      "patentNumber": "KR20240176550A",
      "abstract": "본 문서는 백라이트 유닛 및 액정표시장치에 관한 것이다. 이에 따른 백라이트 유닛은, 빛을 발산하는 LED가 소정간격으로 평면 배치되는 보드, 및 상부과 하부가 개방된 캐비티를 포함하며 상기 보드의 상면에 형성되는 가이딩부를 포함하고, 상기 LED는 상기 캐비티의 하부에 형성될 수 있다."
    },
    {
      "patentNumber": "KR20240175141A",
      "abstract": "본 발명의 일 실시형태는 서로 마주보는 제1면 및 제2면을 가지는 기판, 상기 기판의 제1면 측에 배치되며 제1 트렌치를 포함하는 제1 인터레이어, 상기 제1 트렌치에 배치된 제1 트렌치 커패시터, 상기 기판의 제2면 측에 배치되며 제2 트렌치를 포함하는 제2 인터레이어, 상기 제2 트렌치에 배치된 제2 트렌치 커패시터 및 상기 기판을 관통하여 상기 제1 트렌치 커패시터와 제2 트렌치 커패시터를 연결하는 관통 비아를 포함하는 커패시터 부품을 제공한다."
    },
    {
      "patentNumber": "TW202441539A",
      "abstract": "Provided are a method for manufacturing an electrode foil that is easy to bend smoothly during winding, and a method for manufacturing a wound capacitor. A method for manufacturing an electrode foil 1 includes a surface area expansion step (S01) for forming an expanded surface area portion on the surface of a foil having having a strip shape, and a division step (S03, S06) for forming, so as to extend in the width direction of the foil strip, a plurality of cracks 4 that divide the expanded surface area portion 3. The division step (S03, S06) is performed multiple times to increase the depth of the cracks 4 over multiple treatments."
    },
    {
      "patentNumber": "TW202439637A",
      "abstract": "A device includes: a first electrode; a first interfacial layer in contact with the first electrode; a first insertion layer on the first interfacial layer, the first insertion layer having first orthorhombic-phase (O-phase) regions or first monoclinic-phase (M-phase) regions in a first area ratio that exceeds about 70%; a first dielectric layer on the first insertion layer, the first dielectric layer having tetragonal-phase (T-phase) regions in a second area ratio that exceeds those of second O-phase regions and second M-phase regions; a second insertion layer on the first dielectric layer, the second insertion layer having third O-phase regions or third M-phase regions in a third area ratio that exceeds about 70%; a second interfacial layer in contact with the second insertion layer, the second interfacial layer being a different material than the first interfacial layer; and a second electrode on the second interfacial layer."
    },
    {
      "patentNumber": "TW202438561A",
      "abstract": "A method for manufacturing a semi-solid capacitor is provided. The method includes providing a capacitor element, immersing the capacitor element in a dispersion solution, drying an immersed capacitor element, immersing a dried capacitor element in an electrolytic solution and packing a capacitor element immersed by the electrolytic solution. The dispersion solution is a conductive polymer formed from at least one of polythiophene with at least one surfonyl acid group and polyselenophene with at least one surfonyl acid group."
    },
    {
      "patentNumber": "TW202439349A",
      "abstract": "The present invention relates to a polymer capacitor comprising an anode, a dielectric layer and a cathode, wherein said cathode comprises a solution-processed n-type conducting polymer having conductivity of at least 100 S/cm, preferably at least 500 S/cm."
    },
    {
      "patentNumber": "KR20240176242A",
      "abstract": "본 발명은 전지 모듈 및 이를 포함하는 전지 팩을 포함하고, 본 발명의 일 실시예에 따른 전지 모듈은, 복수의 전지셀이 적층되어 있는 전지셀 적층체, 및 상기 전지셀 적층체와 전기적으로 연결된 버스바와 상기 전지셀 적층체를 적어도 일측에서 커버하는 버스바 프레임을 포함하는 버스바 조립체를 각각 포함하는 제1 서브 모듈 및 제2 서브 모듈; 상기 제1 서브 모듈 및 상기 제2 서브 모듈이 수납되는 모듈 프레임; 및 상기 제1 서브 모듈 및 상기 제2 서브 모듈 사이에 위치하는 화염 방지 부재를 포함하고, 상기 제1 서브 모듈의 일단부 및 상기 제2 서브 모듈의 타단부는 서로 전기적으로 연결된다."
    },
    {
      "patentNumber": "KR20240176437A",
      "abstract": "본 발명은 양극 활물질, 이를 포함하는 양극 및 리튬 이차전지에 관한 것으로, 구체적으로, 단입자 형태의 리튬 복합 전이금속 산화물을 포함하고, 상기 리튬 복합 전이금속 산화물은 본 명세서에 기재된 식 1을 만족하는 것인 양극 활물질, 이를 포함하는 양극 및 리튬 이차전지에 관한 것이다."
    },
    {
      "patentNumber": "KR20240176542A",
      "abstract": "본 발명은 전극 조립체가 수납되고 전해액이 주입되는 본체부 및 상기 본체부에서 일측으로 연장된 가스 포켓부를 갖는 파우치의 디가싱 장치에 있어서, 상기 가스 포켓부에 디가싱 홀을 타공하는 피어싱부; 상기 디가싱 홀 상에 반투과성 막을 부착 및 제거하는 막이동부; 상기 가스 포켓부를 가압하여 상기 가스 포켓부 내부에 잔존하는 상기 전해액을 밀어내는 가압부 및 상기 가스 포켓부의 일부를 밀봉하는 실링 유닛을 포함하는 이차전지의 디가싱 장치에 관한 것이다."
    },
    {
      "patentNumber": "KR20240176290A",
      "abstract": "본 발명은 양극, 음극, 상기 양극과 상기 음극 사이에 구비된 분리막, 및 전해질을 포함하는 리튬 이차 전지로서, 상기 음극은 실리콘계 활물질을 포함하고, 0.33 C로 충방전하여 히스테리시스 면적을 산출하였을 때, 상기 음극의 히스테리시스 면적 B에 대한 상기 양극의 히스테리시스 면적 A의 백분비(A/B*100) X는 40% < X < 60%인 것인 리튬 이차 전지에 관한 것이다."
    },
    {
      "patentNumber": "KR20240176346A",
      "abstract": "예시적인 실시예들에 따르면, 배터리 셀 어셈블리가 제공된다. 상기 배터리 셀 어셈블리는, 셀 스택; 및 상기 셀 스택에 결합된 제1 및 제2 버스 바 프레임들; 상기 제1 버스 바 프레임에 실장된 제1 집적 회로; 상기 제2 버스 바 프레임에 실장된 제2 집적 회로; 및 상기 제1 버스 바 프레임에 결합된 리드 커버 어셈블리를 포함하되, 상기 리드 커버 어셈블리는, 상기 제1 버스 바 프레임에 결합된 리드 커버 프레임; 및 상기 리드 커버 프레임에 실장된 제3 집적 회로를 포함한다."
    },
    {
      "patentNumber": "KR20240175218A",
      "abstract": "수신기, 그의 동작 방법, 및 메모리 장치가 개시된다. 본 개시의 기술적 사상에 따른 시간 기반의 수신기는, 적어도 하나의 파라미터를 기초로 데이터 신호를 특정 시간 차이를 갖는 제1 및 제2 신호들로 변환하고, 상기 제1 및 제2 신호들을 기초로 디코딩된 데이터를 출력하는 디코딩 회로; 및 상기 제1 및 제2 신호들 중 어느 하나의 신호 및 기준 타이밍 신호를 기초로 상기 적어도 하나의 파라미터의 값을 교정하는 교정 회로를 포함한다."
    },
    {
      "patentNumber": "TW202441899A",
      "abstract": "A receiver system is provided for receiving a coherent Pulse Amplitude Modulation (PAM) encoded signal. The receiver system may include an optical polarization component configured to modulate a polarization of the received coherent PAM encoded signal. The receiver system may further include a digital signal processor (DSP) configured to perform polarization recovery between the received coherent PAM encoded signal and the LO signal using a first control loop, and to perform phase recovery between the received coherent PAM encoded signal and the LO signal using a second control loop."
    },
    {
      "patentNumber": "KR20240174798A",
      "abstract": "본 발명은 GPS 수신기 성능 평가 장치 및 그 방법에 관한 것으로, SBAS(Satellite Based Augmentation System)수신기를 초기화한 후, SBAS신호를 수신하는 SBAS신호수신부; 상기 수신된 SBAS신호를 신호처리하여 전달하는 SBAS신호처리부; GPS(Global Positioning System)수신기를 초기화한 후, GPS신호를 수신하는 항법신호수신부; 상기 수신된 GPS신호를 신호처리하여 전달하는 항법신호처리부; 상기 GPS신호에 대응하는 GPS정보와 상기 SBAS신호에 대응하는 SBAS정보를 시각 동기화하여 입력시키는 데이터입력부; 상기 GPS수신기의 초기화 성능을 평가한 후, 상기 GPS정보 및 SBAS정보를 이용하여 상기 GPS수신기의 보강위치를 평가하는 수신기성능평가부; 및 상기 GPS수신기의 초기화시간 및 위치보강정보 적용결과의 성능 평가에 대응하여 도출되는 상기 GPS수신기의 성능평가결과를 출력하는 성능결과출력부;를 포함함으로써, 성능 평가를 수행하는 장비의 제한 없이도 GPS 수신기의 성능을 효과적으로 평가할 수 있다."
    },
    {
      "patentNumber": "KR20240174377A",
      "abstract": "수신기, 그의 동작 방법, 및 메모리 장치가 개시된다. 본 개시의 기술적 사상에 따른 수신기는, 외부로부터 입력되는 신호들 간의 전압 레벨 차이를 시간 차이로 변환하는 전압 시간 변환기, 전압 시간 변환기의 변환 신호들 중 먼저 입력되는 제1 선착 신호에 따라 제1 비트 값을 결정하는 제1 시간 비교기, 제1 비트 값에 의해 확인된 제1 선착 신호를 늦게 입력된 변환 신호보다 문턱 지연 시간만큼 더 지연시키는 지연 시간 발생기, 지연 시간 발생기의 지연 신호들 중 먼저 입력되는 제2 선착 신호에 따라 제2 비트 값을 결정하는 제2 시간 비교기를 포함한다."
    },
    {
      "patentNumber": "KR20240174799A",
      "abstract": "본 발명은 GPS 수신사이트의 가용성 예측 장치 및 그 방법에 관한 것으로, GPS(Global Positioning System)신호를 수신하는 GPS신호수신부; 상기 GPS신호의 GPS항법메시지에서 위성궤도를 포함하는 위성정보를 획득하는 위성정보획득부; SBAS(Satellite Based Augmentation System)신호를 수신하는 SBAS신호수신부; 상기 SBAS신호에서 위성궤도파라미터를 포함하는 SBAS정보를 획득하는 SBAS정보획득부; GPS 수신사이트에 대응하여 촬영시간을 포함하는 사이트정보를 입력하는 사이트정보입력부; 및 상기 위성정보, SBAS정보 및 사이트정보를 이용하여 상기 GPS 수신사이트의 가용성을 예측하는 가용성예측부;를 포함함으로써, GPS위성정보를 분석하고, GPS 수신사이트의 가용성을 평가하여 미래의 임의 시점에서 GPS위성 위치를 정확하게 예측할 수 있다."
    },
    {
      "patentNumber": "KR20240176795A",
      "abstract": "본 발명은 소형화가 가능한 인코더, 서보 모터 및 서보 시스템을 제공하는 것을 목적으로 한다. 인코더(7)는, 회전 축심(Ax) 주위로 회전 가능한 허브(17)와, 허브(17)에 고정되며, 링형의 스케일(S)이 형성된 디스크(19)와, 디스크(19)에 대향하도록 배치되며, 스케일(S)을 검출하는 광학 모듈(25)과, 디스크(19)보다 회전 축심(Ax)의 방향에서의 부하측에 배치되며, 허브(17)에 고정된 자석(33)과, 디스크(19)보다 회전 축심(Ax)의 방향에서의 반부하측에 배치되며, 자석(33)의 자기를 검출하는 트리거 신호 발생기(31)를 갖는다."
    },
    {
      "patentNumber": "KR102746045B1",
      "abstract": "고속 회전을 인가하기 위해 모터를 사용하는 경우, 별도의 기계적 모터 보호장치의 적용을 통한 이중화 대비가 가능한 구동 모터 보호 기구가 제공된다. 상기 구동 모터 보호 기구는, 중공에 요홈이 형성되는 구동 모터 회전축, 상기 구동 모터 회전축의 중공에 삽입되는 동력 전달축, 및 상기 동력 전달축의 말단에 삽입 체결되며, 일정 이상의 전단력이 가해지면 파단되는 파단부를 포함하는 것을 특징으로 한다."
    },
    {
      "patentNumber": "KR20240176734A",
      "abstract": "다양한 실시예에 따르면, 전자 장치는, 제1하우징과, 상기 제1하우징과 슬라이딩 가능하게 결합되는 제2하우징과, 상기 제1하우징에 배치되는 구동 모터와, 상기 구동 모터를 통해 회전 가능하게 배치되는 제1기어와, 상기 제1기어와 기어 결합되는 제2기어 및 상기 제2하우징에 배치되고, 상기 제1기어 및 상기 제2기어와 기어 결합되는 랙 구조체를 포함하고, 상기 랙 구조체는, 상기 제1기어와 기어 결합된 제1랙 기어 및 상기 제1랙 기어와 적어도 부분적으로 이격 배치되고, 상기 제2기어와 기어 결합된 제2랙 기어를 포함하고, 상기 제1랙 기어와 상기 제2랙 기어는, 상기 구동 모터를 통해 상기 제1기어가 회전될 때, 동일한 방향으로 이동될 수 있다. 그 밖에 다양한 실시예들이 가능할 수 있다."
    },
    {
      "patentNumber": "KR20240176195A",
      "abstract": "전기 이동수단의 구동 모터 시스템 및 구동 시스템이 개시되며, 본원의 일 실시예에 따른 전기 이동수단의 구동 모터 시스템은, 직류 전원을 인가받아 교류 전원으로 변환하는 인버터; 구동력을 제공하는 모터; 및 상기 모터로부터 제공된 구동력을 증대시켜 상기 전기 이동수단의 휠에 전달하는 감속기를 포함하고, 상기 모터와 상기 감속기는 모터 하우징의 내부에 설치되어 있는 것을 특징으로 한다."
    },
    {
      "patentNumber": "KR20240176353A",
      "abstract": "본 발명에 따른 스테이터 하우징과 커버의 고정 구조가 개선된 팬 모터 장치는, 원통 형상의 금속 재질로 이루어진 스테이터 하우징; 및 상기 스테이터 하우징의 개방부를 폐쇄하도록 상기 스테이터 하우징에 고정된 커버를 포함한 팬 모터 장치에 있어서, 상기 스테이터 하우징의 상단 또는 하단 모서리로부터 돌출 형성된 한 쌍의 뿔 형상의 코킹 톱니부를 구비하며, 한 쌍의 상기 코킹 톱니부는 서로 멀어지는 방향으로 소성변형되어 상기 커버의 일부를 소성변형시키면서 상기 커버에 접촉 고정된 것을 특징으로 한다."
    },
    {
      "patentNumber": "KR20240176751A",
      "abstract": "전자 장치는, 제1 하우징 파트 및 제2 하우징 파트를 포함하는 하우징, 상기 제2 하우징 파트에 배치되는 제1 기판, 상기 제1 하우징 파트에 배치되는 제2 기판, 상기 제1 기판 및 상기 제2 기판을 전기적으로 연결하는 제3 기판, 상기 제1 기판에 배치되는 적어도 하나의 프로세서, 상기 제1 기판에 배치되는 RF 트랜시버, 상기 제1 기판에 배치되고, 상기 RF 트랜시버로부터의 제1 신호에 기반하여 제1 커플링 신호를 제공하도록 구성되는 제1 커플러, 및 상기 제2 기판에 배치되고, 상기 제3 기판으로부터의 제2 신호에 기반하여 제2 커플링 신호를 제공하도록 구성되는 제2 커플러를 포함한다. 이 외에도, 다양한 실시예들이 가능할 수 있다."
    },
    {
      "patentNumber": "KR20240176703A",
      "abstract": "본 개시는 서로 다른 주파수 대역의 신호에 공진하는 둘 이상의 안테나를 포함하여 구성되는 안테나 모듈 및 이의 제조 방법에 관한 기술로, 열융착 테이프로 안테나 기재를 가 접착한 후에 리플로우 공정을 통해 안테나 기재의 접합부를 접합하고, 제1 안테나 기재 및 제2 안테나 기재의 접합부에 서로 다른 재질의 금속층을 형성하여 안테나 기재들 사이의 접합 강도(접합력)를 유지하면서 안테나 모듈의 단가 상승을 최소화한다."
    },
    {
      "patentNumber": "KR20240176736A",
      "abstract": "본 문서에 개시되는 일 실시예에 따른 전자 장치는, 제1 하우징부 및 제2 하우징부를 포함하는 하우징, 플렉서블 디스플레이, 상기 제1 하우징부에 대하여 상기 제2 하우징부를 이동시키도록 설정된 구동부(actuator), 상기 제1 하우징부의 측면 프레임의 제1 부분을 이용하여 무선 통신을 수행하는 제1 안테나, 상기 제1 하우징부의 상기 측면 프레임의 제2 부분을 이용하여 무선 통신을 수행하는 제2 안테나, 상기 제1 하우징부 또는 상기 제2 하우징부의 이동을 감지하는 센서 모듈, 상기 제1 안테나 또는 상기 제2 안테나를 통해 무선 신호를 송수신하는 통신 회로, 및 상기 디스플레이의 확장 거리를 기반으로 상기 제1 안테나 또는 상기 제2 안테나 각각에 포함된 튜너(tuner)의 튠 코드(tune code)를 변경하는 프로세서를 포함할 수 있다. 이 외에도 명세서를 통해 파악되는 일 실시예가 가능하다."
    },
    {
      "patentNumber": "KR20240176399A",
      "abstract": "일 실시예에 따르면, 전자 장치는, 배터리, 상기 배터리의 일면에 배치되고, 제 1 주파수 대역에 대응되는 안테나로 기능하는 고정 부재, 상기 배터리의 타면에 배치되고, 고정 부재와 전기적으로 연결되는 통신 회로를 포함하는 인쇄 회로 기판을 포함할 수 있다. 전자 장치는 복수 개의 수동 소자들 중 적어도 하나의 수동 소자와 고정 부재를 전기적으로 연결하기 위한 스위치 모듈, 메모리, 및 통신 회로, 스위치, 및 메모리에 작동적으로 연결된 프로세서를 포함할 수 있다. 일 실시예에 따르면, 프로세서는 배터리의 잔량을 확인할 수 있다. 프로세서는 확인된 배터리의 잔량 및 제 1 주파수 대역을 기반으로, 고정 부재에 연결되기 위한 수동 소자 관련 정보를 확인할 수 있다. 프로세서는 확인된 수동 소자 관련 정보를 기반으로 복수 개의 수동 소자들 중 적어도 하나의 수동 소자를 선택할 수 있다. 프로세서는 선택된 적어도 하나의 수동 소자와 고정 부재가 전기적으로 연결되도록 스위치를 제어할 수 있다. 그 밖에 다양한 실시예들이 가능할 수 있다."
    },
    {
      "patentNumber": "KR20240176158A",
      "abstract": "본 발명은 무선신호 커버리지가 겹치도록 인접한 위치에 설치되어 동일한 신호를 수신한 복수의 통신 모뎀의 출력 신호를 비교기가 품질을 분석하여 최적의 모뎀 출력 신호를 선택하여 최종 모뎀의 출력 신호로 출력하여 안테나 다이버시티 효과를 달성한다."
    },
    {
      "patentNumber": "KR102745754B1",
      "abstract": "마이크로버블 생성부를 포함하는 전해조 시스템이 개시된다. 본 발명의 실시예에 따른 전해조 시스템은, 외부 전원 공급부의 공급 전원을 수용하는 전극단자를 상단에 장착하고, 전극단자로부터 수용한 전력에 의한 전기분해를 통해 산소 가스와 수소 가스를 발생시키는 구조를 다수 적층한 구조의 가스 발생부; 상기 가스 발생부의 내부에 장착된 분리막의 일측면에 장착되고, 다수의 에칭가공홀이 일정 간격 이격되어 다수 형성된 박판형 구조이고, 수소이온농도지수(Ph) 0 내지 11 사이의 환경에서 내구성을 가지는 구조의 에칭플레이트; 상기 가스 발생부의 일측면과 타측면에 장착되고, 가스 발생부에 물을 주입함과 동시에 가스 발생부에서 발생된 산소와 수소를 분리하여 배기하는 구조의 양단 장착부; 및 상기 양단 장착부 내부에 물을 주입함과 동시에 마이크로 버블을 주입하는 구조의 마이크로버블 생성부;를 포함하는 것을 구성의 요지로 한다. 본 발명에 따르면, 티타늄 부직포와 분리막의 압력에 의한 손상을 방지할 수 있고, 분리막의 손상을 방지함과 동시에 내압을 증가시킬 수 있으며, 전해조 내부에 인입되는 물의 양을 증가시킬 수 있고, 그에 따른 수소 발생량을 증가시킬 수 있으며, 전기분해 효율을 현저히 향상시킬 수 있고, 전력 효율을 향상시킬 수 있는 전해조 시스템을 제공할 수 있다."
    },
    {
      "patentNumber": "KR20240176251A",
      "abstract": "본 발명은 본 발명은 클록 발생기 및 이를 포함하는 전압 발생 회로에 관한 것이다. 이러한 본 발명은 제1 전류와 제어신호에 기초하여 제어전압을 생성하는 전압 공급부; 제1 기준전압과 제어전압을 비교하여 제어신호를 출력하고, 제1 기준전압과 상이한 전압 레벨을 갖는 제3 기준전압을 제어전압과 비교하여 제1 클록을 생성하는 제1 클록 출력부; 및 제2 기준전압과 제어전압을 비교하고, 제2 기준전압과 상이한 전압 레벨을 갖는 제4 기준전압을 제어전압과 비교하여, 제1 클록과 상이한 위상을 갖는 제2 클록을 생성하는 제2 클록 출력부를 포함할 수 있다."
    },
    {
      "patentNumber": "KR20240176761A",
      "abstract": "본 발명은 이미지 생성 시스템 및 방법, 이미지 생성을 위한 프롬프트 제너레이터에 관한 것으로, 생성 대상 이미지에 대해 입력된 텍스트 구조를 분석하여 분석된 각 요소에 대해 상세 정보를 추가하여 장면 증강 텍스트를 생성하고, 사용자가 선택하거나 상기 분석 결과에 기초한 이미지 스타일, 그리고 상기분석 결과에 기초한 감정 판단에 따르는 형용사 중 하나 이상을 포함하는 이미지 스타일 텍스트를 생성하며, 상기 장면 증강 텍스트 및 상기 이미지 스타일 텍스트로부터 상기 AI 모델에 입력되는 하나 이상의 최종 프롬프트를 생성할 수 있다. 본 발명에 따르면, 사용자의 간단한 입력을 통해 의도에 부합하는 이미지를 생성할 수 있다."
    },
    {
      "patentNumber": "KR20240176333A",
      "abstract": "본 발명은 선박 프로펠러의 구동축인 샤프트의 회전력을 이용해 발전하는 샤프트 발전기 관련 어셈블리에 관한 것으로, 더욱 상세하게는 샤프트 회전 시 발생하는 발전기의 움직임을 제약해서 안정된 발전 상태가 유지되도록 하며 발전기의 바디와 샤프트 간에 신속한 분리와 이동을 가능토록 한 선박의 사프트 발전기 고정용 사이드 스토퍼를 갖춘 발전 구조 어셈블리와 분해 방법에 관한 것으로, 영구자석 장착용 로터(220)가 회전을 위해 샤프트(100)에 고정되고, 코일 장착용 스테이터(230)가 로터(220)와 에어갭(Air Gap)을 유지하면서 샤프트(100)의 둘레를 감싸도록 배치되며, 선체(B)에 설치된 발전기의 시트(240)에 안착되는 발전기의 바디(210)가 스테이터(230)를 수용해 고정하는 구조의 발전 구조 어셈블리에 있어서, 상기 바디(210)의 외측면과 마주하도록 시트(240)에 안착 고정되고 바디(210)와 마주하는 내측면에 상방으로 개구된 맞물림 홈(311)이 형성된 하부모듈(310)과, 사모턱 이음 형태를 이루도록 맞물림 홈(311)에 끼워지는 맞물림 돌기(321)가 하방으로 돌출되어서 하부모듈(310)에 탈착 가능하게 안착하며 체결되는 상부모듈(320)과, 하부모듈(310) 및 상부모듈(320)이 바디(210)를 긴밀히 지지하도록 바디(210)와 상부모듈(320) 사이에 강제 압입되는 코터모듈(330)을 갖춘 사이드 스토퍼(300)가 하나 이상 구비되어 이루는 것이다."
    },
    {
      "patentNumber": "KR20240175038A",
      "abstract": "본 발명은 에어로졸 발생장치에 구비되는 발열 히터에 관한 것으로 더욱 상세하게는 퍼프가 없는 경우 궐련형 에어로졸 발생물품과 발열 히터 사이의 내부 압력을 오차 허용 범위에서 균일하게 유지하여 퍼프 횟수 카운트시 오작동을 줄일 수 있는 에어로졸 발생장치의 발열 히터에 관한 것이다. 본 발명의 일 실시예에 따른 에어로졸 발생장치용 발열 히터는 궐련형 에어로졸 발생물품이 삽입되는 중공이 수직 방향으로 형성된 몸체와; 상기 몸체에 연결되는 리드선;을 포함하고, 상기 중공에 삽입된 궐련형 에어로졸 발생물품과 상기 몸체의 내측면 사이에 형성되는 기류 이송 공간 구조;를 구비한다."
    },
    {
      "patentNumber": "KR20240175033A",
      "abstract": "본 발명은 1개 이상의 엔진에서 동력을 전달받아 각 필요 구성품별 동력을 분해하여 전달하는 화재방지 구조를 갖는 기어박스 및 이를 활용한 기어박스 점검방법에 관한 것으로, 기어박스와 상기 샤프트 기어 사이에 배치되고, 길이방향으로 이격 배치되는 복수 개의 오일씰 및 상기 오일씰 간 사이에 형성되고, 오일이 포집되도록 상기 기어박스의 내면에 포집공간이 형성된 포집부를 포함한다. 기어박스 내에 복수개의 오일씰을 배치하고, 오일씰의 사이에 오일이 포집되는 포집부를 형성하여 기어박스의 외측으로 오일이 새어나오는 것을 방지한다."
    },
    {
      "patentNumber": "KR102742732B1",
      "abstract": "본 발멸은 초고속 증속장치에 관한 것으로, 지지대와; 지지대의 일측에 설치되는 증속기와; 증속기에 설치되어 일반 모터가 결합되는 회전력을 전달하는 클램핑과; 증속기의 출력측에 위치되게 지지대에 설치되어 토크를 감지하여 전기적 신호를 출력하는 토크센서와; 오일을 증속기로 순화시켜 증속기를 냉각시키는 오일냉각기;를 포함하는 것을 특징으로 하며. 증속기의 입력축에 일반 모터에 의해 회전력을 부여하여 증속기를 구동한 다음 출력축으로 출력되는 회전력을 측정하면서 브레이크 시스템, 트렌스미션 등을 포함하는 시험장비를 시험, 평가하는 것은 물론 고가의 초고속 모터를 사용하지 않고 일반 모터를 사용하면서 초고속의 회전을 브레이크 시스템, 트렌스미션 등을 포함하는 시험장비로 인가하여 시험, 평가를 할 수 있으므로 비용을 절감하면서 시험이 이루어지는 효과가 있다.경기도의 지원으로 하기의 사업이 발생되어 진행되었다.[과제번호] D2222008[부처명] 경기도[과제관리(전문)기관명] 경기도경제과학진흥원[연구사업명] 2022년 경기도 기술개발사업 , 기업주도(일반)[연구과제명] 전기자동차용 감속기 검증용 초고속 증속기 기술 시스템 고유모델[기여율] 1/1[과제수행기관명] : 주식회사 길앤에스[연구기간] 2022-07-01 ~ 2023-06-30"
    },
    {
      "patentNumber": "KR20240175404A",
      "abstract": "본 발명은 항공기 기동 시, 윤활 및 냉각을 위한 오일이 저장되고, 오일을 흡입하는 오일펌프가 배치된 오일량 축소를 위한 가변 격벽을 갖는 기어박스에 관한 것으로, 하우징의 하부에 결합되고, 오일이 포집되는 포집부와 상기 포집부에 배치된 오일펌프를 포함하고, 상기 포집부의 상단에 형성되고, 오일이 통과되도록 하나 이상의 관통홀이 형성된 경사부 및 기어박스의 기울기에 따라 상기 관통홀을 개폐되도록 상기 경사부의 하면에 힌지 결합되는 격벽을 포함한다. 가변되는 격벽에 의해 오일레벨이 상승하여 기어박스 내부 기어 및 축류 구동 시, 처닝에 의한 드레그 토크가 감소되어 전달효율이 상승하는 장점이 있다."
    },
    {
      "patentNumber": "AU2023337284A1",
      "abstract": "Provided are a hydraulic system for a hybrid gearbox and an automobile. The hydraulic system comprises a first drive pump (1), a second drive pump (2), a high-pressure oil passage (3), a low-pressure oil passage (4) and a control valve set (5), wherein the first drive pump (1) is used for being connected to a drive motor (100) of the automobile; the second drive pump (2) is used for being connected to an engine (200) of the automobile; the high-pressure oil passage (3) is connected to the first drive pump (1); the control valve set (5) is respectively connected to the second drive pump (2), the high-pressure oil passage (3) and the low-pressure oil passage (4), and the control valve set (5) is used for controlling, according to the operating condition of the automobile, the oil pressure of the high-pressure oil passage (3) and controlling the amount of oil supplied by the low-pressure oil passage (4) to components to be lubricated (101, 102, 103). By means of the hydraulic system, appropriate hydraulic oil can be provided for the hybrid gearbox according to the actual working condition of the automobile, finally the power consumption can be reduced, and the efficiency of the hybrid gearbox is improved."
    },
    {
      "patentNumber": "US12173660B1",
      "abstract": "A reduction gearbox is provided that includes a sun gear, planet gear assemblies, first and second ring gears, and a ring gear positional alignment system. Each planet gear assembly includes a main gear and first and second lateral gears coupled to one another. The ring gear positional alignment system includes a system controller, a ring gear actuator, and a sensor. The ring gear actuator is engaged with the first ring gear and is configured to rotate the first ring gear relative to the second ring gear. The system controller is in communication with the sensor, the ring gear actuator, and a non-transitory memory storing instructions. The instructions when executed cause the system controller to receive and process signals from the sensor relating to the position of the first ring gear, and control the ring gear actuator to selectively position the first ring gear using the signals from the sensor."
    },
    {
      "patentNumber": "KR102746972B1",
      "abstract": "전기화학식 일산화탄소 가스센서는 상부 케이스, 양극 지지플레이트, 음극 지지플레이트, 밀봉링, 멤브레인 전극부, 양극집류멤브레인 가이드필름, 하우징 등을 포함한다. 양극 지지플레이트는 상부케이스 날개부와 결합하는 외측 가장자리 영역을 상방으로 절곡시킨 양극 단차부를 형성한다. 음극 지지플레이트는 외측 가장자리 영역을 상방으로 절곡시킨 음극 단차부를 형성한다."
    },
    {
      "patentNumber": "KR20240176285A",
      "abstract": "제1면과 이에 반대되는 제2면을 가지며, 화소 어레이 영역을 포함하는 제1 기판; 상기 제1면측 상기 제1 기판 내에 배치되어 상기 제1면의 활성 영역들을 분리하는 소자 분리부; 상기 제1 기판의 상기 활성 영역 내에 형성되어 있는 복수의 부유 확산 영역; 및 적어도 일부가 상기 소자 분리부 내에 매립되어 있으며, 상기 복수의 부유 확산 영역 중 적어도 2개 사이를 연결하는 부유 확산 영역 연결부를 포함하는 이미지 센서."
    },
    {
      "patentNumber": "KR20240176645A",
      "abstract": "이미지 프로세싱 장치가 제공된다. 이미지 프로세싱 장치는 비전센서의 픽셀 어레이로부터 로우 이벤트 신호를 수신하여, 상기 로우 이벤트 신호를 기설정된 시간 동안 누적하여 누적 이벤트 데이터로 저장하고, 상기 저장된 누적 이벤트 데이터를 픽셀 보정하고, 상기 보정된 누적 이벤트 데이터와 상기 로우 이벤트 신호를 비교하여 유효 이벤트 데이터를 추출한다."
    },
    {
      "patentNumber": "KR20240176186A",
      "abstract": "본 발명에 따른 라이다 센서의 캘리브레이션을 위한 장치는, 광의 조사에 의하여 차트를 형성하도록 구성된 차트 유닛; 상기 차트 유닛의 전방 바닥면에 지지되기 위한 베이스를 포함하는 프레임 유닛; 상기 베이스 상에 지지되어 검사 대상인 라이다 센서를 고정할 수 있게 형성되며, 상기 라이다 센서가 다축 방향으로 이동 가능하도록 구성된 모션 유닛; 및 상기 프레임 유닛에 설치되며, 상기 차트 유닛 및 상기 모션 유닛을 제어할 수 있게 형성된 제어 유닛을 포함한다."
    },
    {
      "patentNumber": "KR20240176715A",
      "abstract": "본 발명은 자기저항 센서에 포함되는 자기저항 소자의 반강자성층의 효과를 높여 자기저항 센서가 외부저항 변화에 대한 민감도가 높고 양호한 히스테리시스 곡선을 나타내도록 하는 것을 목적으로 한다. 상기와 같은 목적을 달성하기 위해, 본 발명에 따른 자기저항 센서는 강자성(ferromagnetic) 박막을 포함하는 자기저항 소자와 상기 자기저항 소자 근처에 배치되는 영구자석을 포함하고, 상기 영구자석에 의해 형성되는 자기장 중 적어도 일부의 방향은 상기 강자성 박막의 초기 원자스핀 방향과 평행한 방향이 되도록 상기 영구자석이 배치될 수 있다."
    },
    {
      "patentNumber": "TW202441901A",
      "abstract": "A voltage regulator circuit includes a first amplifier, a second amplifier and a transistor. Respective first input terminals of the first and second amplifiers are coupled to a first reference voltage and a second reference voltage, respectively. A connection terminal of the transistor is coupled to a supply voltage. A control terminal of the transistor is selectively coupled to one of respective output terminals of the first and second amplifiers. When the control terminal of the transistor is coupled to the output terminal of the first amplifier, another connection terminal of the transistor is coupled to a second input terminal of the first amplifier to output a regulated voltage. When the control terminal of the transistor is coupled to the output terminal of the second amplifier, the another connection terminal of the transistor is coupled to a second input terminal of the second amplifier to output the regulated voltage."
    },
    {
      "patentNumber": "TW202441501A",
      "abstract": "A transmitter configured to receive first to N-th data in parallel and sequentially output the first to N-th data in response to first to N-th clock signals having different phases from each other, where N is an integer of at least 2, the transmitter including first to N-th data selectors including a first data selector and a second data selector in correspondence to the first to N-th data, each of the first to N-th data selectors being configured to perform a logical operation on one of the first to N-th data and the first to N-th clock signals and output a plurality of data selection signals, a first pre-driver in correspondence to at least two data selectors among the first to N-th data selectors, the first pre-driver being configured to receive the plurality of data selection signals from the at least two data selectors."
    },
    {
      "patentNumber": "TW202439775A",
      "abstract": "The invention discloses a power amplifier and a wireless transmitter, the power amplifier comprises a power device and a matching network, the output end of the power device is connected with the input end of the matching network, the input end of the matching network comprises two input ports, and the power amplifier further comprises a matching capacitor; the matching capacitor is connected in series with the matching network, so that the impedance difference of the two input ports of the matching network is within a preset range; the matching capacitor is connected to the matching network in series, so that the impedance difference of the two input ports of the matching network is within the preset range, the two input ports of the input end of the matching network can obtain consistent impedance, and the output power of the power amplifier can be maximized; and real matching between the power amplifier and the antenna is realized."
    },
    {
      "patentNumber": "TW202439791A",
      "abstract": "An optical transmitter includes a TOSA and an LC parallel circuit. The TOSA is configured to convert a first electrical signal into an optical signal. The LC parallel circuit includes an inductor and a capacitor. The inductor and the capacitor are connected in parallel to each other. The LC parallel circuit is connected to the TOSA."
    },
    {
      "patentNumber": "KR102742110B1",
      "abstract": "본 발명에 따른 함정 내 전투체계 시험 지원을 위한 수평발사관 제어가 가능한 이동형 이산 신호 송수신기 시스템은 상기 전투체계로부터 소정의 DC 전압 기반의 이산 신호를 수신하는 이산신호 입력부, 상기 전투체계로 소정의 DC 전압 기반의 이산 신호를 송신하는 이산신호 출력부, 스위치 입력을 수신하여 출력 설정을 제어하는 스위치 제어부, 현재 설정 정보를 실시간으로 표시하여 사용자에게 출력 설정 상태 및 신호 발생 상태를 시각적으로 제공하는 전시부 및 상기 이산신호 출력부의 상기 DC 전압 기반의 라인을 제어하는 파워 제어부를 포함한다."
    },
    {
      "patentNumber": "KR20240174009A",
      "abstract": "다양한 실시예에 따른 전자 장치 및 전자 장치의 동작 방법에서, 전자 장치는 프로세서를 포함할 수 있다. 전자 장치는, 복수 개의 기준 주파수 중 적어도 하나의 기준 주파수를 갖는 클록 신호를 생성하는 XO(crystal osciliator)를 포함하는 클록 생성 회로를 포함할 수 있다. 전자 장치는 상기 XO에 인가되는 드라이브 레벨 또는 상기 드라이브 레벨의 크기를 제어하기 위한 드라이브 레벨의 제어 값에 따라, 상기 클록 신호의 기준 주파수의 보정에 이용되는 보정 값이 매핑된 복수의 매핑 데이터를 저장하는 메모리를 포함할 수 있다. 상기 프로세서는 상기 전자 장치가 사용하는 통신 방식의 주파수 대역에 따라 상기 XO에 인가될 드라이브 레벨의 제어 값을 선택할 수 있다. 상기 프로세서는 드라이브 레벨의 제어 값에 기반하여 상기 복수의 매핑 데이터 중 하나의 매핑 데이터를 선택할 수 있다. 상기 프로세서는 상기 선택된 매핑 데이터를 참조하여 결정된 보정 값을 이용하여 상기 클록 신호의 기준 주파수를 보정하도록 상기 클록 생성 회로를 제어하도록 설정될 수 있다. 이 밖에 다양한 실시예들이 가능하다."
    },
    {
      "patentNumber": "TW202441887A",
      "abstract": "An amplifier includes a first differential input pair, a reset circuit, a first compensation circuit and a second compensation circuit. The first differential input pair includes a first non-inverting input terminal and a first inverting input terminal, and is configured to amplify a voltage difference between the first non-inverting input terminal and the first inverting input terminal, in order to generate a non-inverting output voltage and an inverting output voltage of the amplifier. The reset circuit is coupled with the first differential input pair, and is configured to reset the non-inverting output voltage and the inverting output voltage of the amplifier according to a reference voltage. The first compensation circuit is configured to provide a first compensation voltage to the first non-inverting input terminal, and the first compensation voltage is positively correlated with the non-inverting output voltage. The second compensation circuit is configured to provide a second compensation voltage to the first inverting input terminal, and the second compensation voltage is positively correlated with the inverting output voltage."
    },
    {
      "patentNumber": "TW202441888A",
      "abstract": "A rail-to-rail input stage circuit including a first P-type transistor, a second P-type transistor, a first N-type transistor, a second N-type transistor, a first processing circuit, a second processing circuit, a first voltage adjustment circuit, and a second voltage adjustment circuit is provided. The first P-type transistor and the first N-type transistor are coupled to a first input terminal. The second P-type transistor and the second N-type transistor are coupled to a second input terminal. When the voltage of the first terminal is higher than a first threshold value, the first voltage adjustment circuit controls the operation of the first processing circuit. When the voltage of the first terminal is lower than a second threshold value, the second voltage adjustment circuit controls the operation of the second processing circuit."
    },
    {
      "patentNumber": "TW202439777A",
      "abstract": "The invention provides an auto calibration circuit, a variable gain amplifier and an auto calibration method for calibrating output voltages of the variable gain amplifier, including: a resistor circuit, a reference signal generating circuit and a comparator circuit. The resistor circuit is configured to receive differential voltages from the variable gain amplifier and to convert the differential voltages to a common mode voltage; the reference signal generating circuit includes a calibration resistor for outputting a reference voltage; the comparator circuit is electrically connected to the reference signal generating circuit and the variable gain amplifier, and is configured to receive one of the differential voltages from the variable gain amplifier and to compare the one of the differential voltages with the reference voltage to output a resistance control signal for controlling a variable resistor circuit of the variable gain amplifier."
    },
    {
      "patentNumber": "TW202439775A",
      "abstract": "The invention discloses a power amplifier and a wireless transmitter, the power amplifier comprises a power device and a matching network, the output end of the power device is connected with the input end of the matching network, the input end of the matching network comprises two input ports, and the power amplifier further comprises a matching capacitor; the matching capacitor is connected in series with the matching network, so that the impedance difference of the two input ports of the matching network is within a preset range; the matching capacitor is connected to the matching network in series, so that the impedance difference of the two input ports of the matching network is within the preset range, the two input ports of the input end of the matching network can obtain consistent impedance, and the output power of the power amplifier can be maximized; and real matching between the power amplifier and the antenna is realized."
    },
    {
      "patentNumber": "TW202439776A",
      "abstract": "A high-voltage chopper-stabilized amplifier can include two paths to compensate for non-ideal electrical parameters. A first path, leading to a primary input of the amplifier, may include a first mux interface circuit to limit voltages at the primary input of the amplifier. A second path, leading to an auxiliary input of the amplifier, may include a chopper amplifier circuit. Despite the first mux interface circuit, a slew condition on the first path may excite a current in the second path that can negatively affect the signal source. Accordingly, the disclosed amplifier further includes a second mux interface circuit that can decouple the second path while a slew condition. The second mux interface circuit is driven by a window floating comparator, which is supplied according to the voltages on primary input. A settling enhancer circuit keeps, during slew condition, certain nodes on the second path at a reference voltage."
    }
  ]
}